=========
Calls
=========

a()
b(1)
c(d)
d(e, f)

---------

(source_file
  (call_expression
    function: (identifier)
    arguments: (argument_list))
  (call_expression
    function: (identifier)
    arguments: (argument_list
      (integer)))
  (call_expression
    function: (identifier)
    arguments: (argument_list
      (identifier)))
  (call_expression
    function: (identifier)
    arguments: (argument_list
      (identifier)
      (identifier))))

=========
Binary
=========

1.0+1.0
1.0-1.0
1.0*1.0
1.0/1.0

---------

(source_file
  (binary_expression
    left: (float)
    (operator)
    right: (float))
  (binary_expression
    left: (float)
    (operator)
    right: (float))
  (binary_expression
    left: (float)
    (operator)
    right: (float))
  (binary_expression
    left: (float)
    (operator)
    right: (float)))

=========
Comparison
=========

1 < 2 <= 3 == 3 >= 2 > 1

---------

(source_file
  (binary_expression
    left: (binary_expression
      left: (binary_expression
        left: (binary_expression
          left: (binary_expression
            left: (integer)
            (operator)
            right: (integer))
          (operator)
          right: (integer))
        (operator)
        right: (integer))
      (operator)
      right: (integer))
    (operator)
    right: (integer)))

=========
Assignments
=========

a = 1
b += c;
[a,b] = c;

---------

(source_file
  (assignment
    left: (identifier)
    (operator)
    right: (integer))
  (assignment
    left: (identifier)
    (operator)
    right: (identifier))
  (assignment
    left: (matrix_pattern
      (identifier)
      (identifier))
    (operator)
    right: (identifier)))

=========
Unary
=========

a++
a'
--b
!b

---------

(source_file
  (unary_expression
    (identifier)
    (operator))
  (unary_expression
    (identifier)
    (operator))
  (unary_expression
    (operator)
    (unary_expression
      (operator)
      (identifier)))
  (unary_expression
    (operator)
    (identifier)))

=========
Member expression
=========

a.b.c = 1

---------

(source_file
  (assignment
    left: (member_expression
      element: (member_expression
        element: (identifier)
        field: (identifier))
      field: (identifier))
    (operator)
    right: (integer)))

=========
Matrix expression
=========

[1 3 3; 4 5 6]

---------

(source_file
  (matrix
    (integer)
    (integer)
    (integer)
    (integer)
    (integer)
    (integer)))

=========
Cell expression
=========

{ 'a'; 1,2,3 }

---------

(source_file
  (cell
    (char)
    (integer)
    (integer)
    (integer)))